Quylongtqt/stm32f4xx_drivers/drivers/Src/stm32f407xx_can_driver.c
}

/****************************************************************************************************
  * @function		-	CAN_FilterInit
  *
  * @brief			-	This Function Configures the CAN reception filter according to the specified
  *         			parameters in the CAN_FilterInitStruct
  *
  * @param[in]    	-	CAN_FilterInitStruct
  *
  * @retval			-	None
  *
  * @Note			-	None
  */
void CAN_FilterInit(CAN_FilterInitTypeDef* CAN_FilterInitStruct)
{
	uint32_t filter_number_bit_pos = 0;

	/* Check parameter */
	assert_param(IS_CAN_FILTER_NUMBER(CAN_FilterInitStruct->CAN_FilterNumber));
	assert_param(IS_CAN_FILTER_NUMBER(CAN_FilterInitStruct->CAN_FilterNumber));
	assert_param(IS_CAN_FILTER_MODE(CAN_FilterInitStruct->CAN_FilterMode));
	assert_param(IS_CAN_FILTER_SCALE(CAN_FilterInitStruct->CAN_FilterScale));
	assert_param(IS_CAN_FILTER_FIFO(CAN_FilterInitStruct->CAN_FilterFIFOAssignment));
	assert_param(IS_FUNCTIONAL_STATE(CAN_FilterInitStruct->CAN_FilterActivation));


	filter_number_bit_pos = ((uint32_t) 1) << CAN_FilterInitStruct->CAN_FilterNumber;

	/* Initialization mode for the filter */
	/* These registers can be written only when the filter initialization mode is set (FINIT=1) in the
	CAN_FMR register.*/
	CAN1->FMR |= FMR_FINIT;

	/*Filter Deactivation */
	CAN1->FA1R &= ~(uint32_t)filter_number_bit_pos;

	/* Filter Scale */
	if(CAN_FilterInitStruct->CAN_FilterScale == CAN_FilterScale_16bit)
	{
		/* 16-bit scale for the filter */
		CAN1->FM1R &= ~(uint32_t)filter_number_bit_pos;
		S
		/* First 16-bit identifier and First 16-bit mask */
		/* Or First 16-bit identifier and Second 16-bit identifier */
		CAN1->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR1 =
			((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdLow) << 16) |
			 (0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdLow);

		/* Second 16-bit identifier and Second 16-bit mask */
		/* Or Third 16-bit identifier and Fourth 16-bit identifier */
		CAN1->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR2 =
			((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdHigh) << 16) |
			 (0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdHigh);
	}

	if(CAN_FilterInitStruct->CAN_FilterScale == CAN_FilterScale_32bit)
	{
		/* 32-bit scale for the filter */
		CAN1->FS1R |= filter_number_bit_pos;

		/* 32-bit identifier or First 32-bit identifier */
		CAN1->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR1 =
			((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdHigh) << 16) |
			(0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterIdLow);

		/* 32-bit mask or Second 32-bit identifier */
		CAN1->sFilterRegister[CAN_FilterInitStruct->CAN_FilterNumber].FR2 =
			((0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdHigh) << 16) |
			(0x0000FFFF & (uint32_t)CAN_FilterInitStruct->CAN_FilterMaskIdLow);
	}

	/* Filter Mode */
	if (CAN_FilterInitStruct->CAN_FilterMode == CAN_FilterMode_IdMask)
	{
		/*Id/Mask mode for the filter*/
		CAN1->FM1R &= ~(uint32_t)filter_number_bit_pos;
	}else /* CAN_FilterInitStruct->CAN_FilterMode == CAN_FilterMode_IdList */
	{
		/*Identifier list mode for the filter*/
		CAN1->FM1R |= (uint32_t)filter_number_bit_pos;
	}

	/* Filter FIFO assignment */
	if(CAN_FilterInitStruct->CAN_FilterFIFOAssignment == CAN_Filter_FIFO0)
	{
		/* FIFO 0 assignation for the filter */
		CAN1->FFA1R &= ~(uint32_t)filter_number_bit_pos;
	}

	if(CAN_FilterInitStruct->CAN_FilterFIFOAssignment == CAN_Filter_FIFO1)
	{
		/* FIFO 0 assignation for the filter */
		CAN1->FFA1R |= (uint32_t)filter_number_bit_pos;
	}

	/* Filter activation */
	if(CAN_FilterInitStruct->CAN_FilterActivation == ENABLE)
	{
		CAN1->FA1R |= filter_number_bit_pos;
	}

	/* Leave the initialization mode for the filter */
	CAN1->FMR &= ~FMR_FINIT;

}
/****************************************************************************************************
  * @function		-	CAN_StructInit
  *
  * @brief			-	This Function Reset CAN init structure parameters values
  *
  * @param[in]    	-	CAN_InitStruct
  *
  * @retval			-	None
  *
  * @Note			-	None
  */
void CAN_StructInit(CAN_Config_t* CAN_InitStruct)
{
  /* Reset CAN init structure parameters values */

  /* Initialize the time triggered communication mode */
  CAN_InitStruct->CAN_TTCM = DISABLE;

  /* Initialize the automatic bus-off management */
  CAN_InitStruct->CAN_ABOM = DISABLE;

  /* Initialize the automatic wake-up mode */
  CAN_InitStruct->CAN_AWUM = DISABLE;

  /* Initialize the no automatic retransmission */
  CAN_InitStruct->CAN_NART = DISABLE;

  /* Initialize the receive FIFO locked mode */
  CAN_InitStruct->CAN_RFLM = DISABLE;

  /* Initialize the transmit FIFO priority */
  CAN_InitStruct->CAN_TXFP = DISABLE;

  /* Initialize the CAN_Mode member */
  CAN_InitStruct->CAN_Mode = CAN_Mode_Normal;

  /* Initialize the CAN_SJW member */
  CAN_InitStruct->CAN_SJW = CAN_SJW_1tq;

  /* Initialize the CAN_BS1 member */
  CAN_InitStruct->CAN_BS1 = CAN_BS1_4tq;

  /* Initialize the CAN_BS2 member */
  CAN_InitStruct->CAN_BS2 = CAN_BS2_3tq;

  /* Initialize the CAN_Prescaler member */
  CAN_InitStruct->CAN_Prescaler = 1;
}

/****************************************************************************************************
  * @function		-	CAN_SlaveStartBank
  *
  * @brief			-	This Function Select the start bank filter for slave CAN.
  *
  * @param[in]    	-	CAN_BankNumber: Select the start slave bank filter from 1..27.
  *
  * @retval			-	None
  *
  * @Note			-	None
  */
void CAN_SlaveStartBank(uint8_t CAN_BankNumber)
{
	/* Check the parameters */
	assert_param(IS_CAN_BANKNUMBER(CAN_BankNumber));

	/* Enter Initialization mode for the filter */
	CAN1->FMR |= FMR_FINIT;

	/* Select the start slave bank */
	CAN1->FMR &= (uint32_t) 0xFFFFC0F1;
	CAN1->FMR |= (uint32_t) (CAN_BankNumber) << 8;

	/* Leave the initialization mode for the filter */
	CAN1->FMR &= ~FMR_FINIT;
}

/****************************************************************************************************
  * @function		-	CAN_DBGFreeze
  *
  * @brief			-	This Function Enables or disables the DBG Freeze for CAN.
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @param[in]    	-	NewState: new state of the CAN peripheral.
  *
  * @retval			-	None
  *
  * @Note			-	None
  */
void CAN_DBGFreeze(CAN_RegDef_t* CANx, FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	if(NewState != DISABLE)
	{
		/* Enable Debug Freeze */
		CANx->MCR |= MCR_DBF;
	}else
	{
		/* Enable Debug Freeze */
		CANx->MCR &= ~MCR_DBF;
	}
}

/****************************************************************************************************
  * @function		-	CAN_TTComModeCmd
  *
  * @brief			-	This Function  Enables or disables the CAN Time TriggerOperation communication mode.
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @param[in]    	-	NewState: new state of the CAN peripheral.
  *
  * @retval			-	None
  *
  * @Note			-	DLC must be programmed as 8 in order Time Stamp (2 bytes) to be
  *         			sent over the CAN bus.
  */
void CAN_TTComModeCmd(CAN_RegDef_t* CANx, FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	if (NewState != DISABLE)
	{
	  /* Enable the TTCM mode */
	  CANx->MCR |= CAN_MCR_TTCM;

	  /* Set TGT bits */
	  /*!< CAN mailbox data length control and time stamp register */
	  CANx->sTxMailBox[0].TDTR |= ((uint32_t)CAN_TDT0R_TGT);
	  CANx->sTxMailBox[1].TDTR |= ((uint32_t)CAN_TDT1R_TGT);
	  CANx->sTxMailBox[2].TDTR |= ((uint32_t)CAN_TDT2R_TGT);
	}else
	{
	/* Disable the TTCM mode */
	CANx->MCR &= (uint32_t)(~(uint32_t)CAN_MCR_TTCM);

	/* Reset TGT bits */
	CANx->sTxMailBox[0].TDTR &= ((uint32_t)~CAN_TDT0R_TGT);
	CANx->sTxMailBox[1].TDTR &= ((uint32_t)~CAN_TDT1R_TGT);
	CANx->sTxMailBox[2].TDTR &= ((uint32_t)~CAN_TDT2R_TGT);
	}
}

