Quylongtqt/stm32f4xx_drivers/drivers/Src/stm32f407xx_can_driver.c
/*
===============================================================================
                ##### CAN Frames Transmission functions #####
 ===============================================================================
    [..] This section provides functions allowing to
      (+) Initiate and transmit a CAN frame message (if there is an empty mailbox).
      (+) Check the transmission status of a CAN Frame
      (+) Cancel a transmit request
 */

/****************************************************************************************************
  * @function		-	CAN_TTComModeCmd
  *
  * @brief			-	This Function Initiates and transmits a CAN frame message.
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @param[in]    	-	TxMessage: pointer to a structure which contains CAN Id, CAN DLC and CAN data.
  *
  * @retval			-	The number of the mailbox that is used for transmission or
  *        				CAN_TxStatus_NoMailBox if there is no empty mailbox.
  *
  * @Note			-	None
  *
  */

uint8_t	CAN_Transmit(CAN_RegDef_t *CANx, CAN_TxMsg* TxMessage)
{
	uint8_t transmit_mailbox = 0;
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));
	assert_param(IS_CAN_IDTYPE(TxMessage->IDE));
	assert_param(IS_CAN_RTR(TxMessage->RTR));
	assert_param(IS_CAN_DLC(TxMessage->DLC));

	/* Select one empty transmit mailbox */
	if((CANx->TSR & CAN_TSR_TME0) == CAN_TSR_TME0)
	{
		transmit_mailbox = 0;
	}else if((CANx->TSR & CAN_TSR_TME1) == CAN_TSR_TME1)
	{
		transmit_mailbox = 1;
	}else if((CANx->TSR & CAN_TSR_TME2) == CAN_TSR_TME2)
	{
		transmit_mailbox = 2;
	}else
	{
		transmit_mailbox = CAN_TxStatus_NoMailBox;
	}

	/* Check whether the transmit_mailbox is available */
	if(transmit_mailbox != CAN_TxStatus_NoMailBox)
	{
		/* Set up the Id */
		CANx->sTxMailBox[transmit_mailbox].TIR &= TMIDxR_TXRQ;
		if(TxMessage->IDE == CAN_ID_STD)
		{
			assert_param(IS_CAN_STDID(TxMessage->StdId));
			CANx->sTxMailBox[transmit_mailbox].TIR |= ((TxMessage->StdId <<21) | \
														TxMessage->RTR);
		}else
		{
			assert_param(IS_CAN_EXTID(TxMessage->StdId));
			CANx->sTxMailBox[transmit_mailbox].TIR |= ((TxMessage->StdId <<3) | \
														TxMessage->IDE | \
														TxMessage->RTR);
		}

		/* Set up the DLC */
		TxMessage->DLC &= (uint8_t) 0x0000000F;
		CANx->sTxMailBox[transmit_mailbox].TDTR &= (uint32_t) 0xFFFFFFF0;
		CANx->sTxMailBox[transmit_mailbox].TDTR |= TxMessage->DLC;

		/* Set up the data field */
		CANx->sTxMailBox[transmit_mailbox].TDLR = 	((uint32_t)TxMessage->Data[3] << 24) | \
													((uint32_t)TxMessage->Data[2] << 16) | \
													((uint32_t)TxMessage->Data[1] << 8)  | \
													((uint32_t)TxMessage->Data[0] << 0);

		CANx->sTxMailBox[transmit_mailbox].TDHR =	((uint32_t)TxMessage->Data[7] << 24) | \
													((uint32_t)TxMessage->Data[6] << 16) | \
													((uint32_t)TxMessage->Data[5] << 8)  | \
													((uint32_t)TxMessage->Data[4] << 0);

		/* Request transmission */
		CANx->sTxMailBox[transmit_mailbox].TIR |= TMIDxR_TXRQ;
	}
	return transmit_mailbox;
}

/****************************************************************************************************
  * @function		-	CAN_TransmitStatus
  *
  * @brief			-	This Function Checks the transmission status of a CAN Frame.
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @param[in]    	-	TransmitMailbox: the number of the mailbox that is used for transmission.
  *
  * @retval			-	CAN_TxStatus_Ok if the CAN driver transmits the message,
  *         			CAN_TxStatus_Failed in an other case.
  *
  * @Note			-	None
  */

uint8_t CAN_TransmitStatus(CAN_RegDef_t* CANx, uint8_t TransmitMailbox)
{
	uint32_t state = 0;
	/* Check parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));
	assert_param(IS_CAN_TRANSMITMAILBOX(TransmitMailbox));

	switch (TransmitMailbox)
	{
	case (CAN_TXMAILBOX_0):
	  state =   CANx->TSR &  (CAN_TSR_RQCP0 | CAN_TSR_TXOK0 | CAN_TSR_TME0);
	  break;
	case (CAN_TXMAILBOX_1):
	  state =   CANx->TSR &  (CAN_TSR_RQCP1 | CAN_TSR_TXOK1 | CAN_TSR_TME1);
	  break;
	case (CAN_TXMAILBOX_2):
	  state =   CANx->TSR &  (CAN_TSR_RQCP2 | CAN_TSR_TXOK2 | CAN_TSR_TME2);
	  break;
	default:
	  state = CAN_TxStatus_Failed;
	  break;
	}
	switch (state)
  {
	  /* transmit pending  */
	case (0x0): state = CAN_TxStatus_Pending;
	  break;
	  /* transmit failed  */
	 case (CAN_TSR_RQCP0 | CAN_TSR_TME0): state = CAN_TxStatus_Failed;
	  break;
	 case (CAN_TSR_RQCP1 | CAN_TSR_TME1): state = CAN_TxStatus_Failed;
	  break;
	 case (CAN_TSR_RQCP2 | CAN_TSR_TME2): state = CAN_TxStatus_Failed;
	  break;
	  /* transmit succeeded  */
	case (CAN_TSR_RQCP0 | CAN_TSR_TXOK0 | CAN_TSR_TME0):state = CAN_TxStatus_Ok;
	  break;
	case (CAN_TSR_RQCP1 | CAN_TSR_TXOK1 | CAN_TSR_TME1):state = CAN_TxStatus_Ok;
	  break;
	case (CAN_TSR_RQCP2 | CAN_TSR_TXOK2 | CAN_TSR_TME2):state = CAN_TxStatus_Ok;
	  break;
	default: state = CAN_TxStatus_Failed;
	  break;
  }
	return (uint8_t) state;
}

/****************************************************************************************************
  * @function		-	CAN_CancelTransmit
  *
  * @brief			-	This Function Cancels a transmit request.
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @param[in]    	-	Mailbox: Mailbox number.
  *
  * @retval			-	None
  *
  * @Note			-	None
  */


void CAN_CancelTransmit(CAN_RegDef_t* CANx, uint8_t Mailbox)
{
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));
	assert_param(IS_CAN_TRANSMITMAILBOX(Mailbox));

	/* abort transmission */
	switch(Mailbox)
	{
	case(CAN_TXMAILBOX_0): CANx->TSR |= CAN_TSR_ABRQ0;
		break;
	case(CAN_TXMAILBOX_0): CANx->TSR |= CAN_TSR_ABRQ1;
		break;
	case(CAN_TXMAILBOX_0): CANx->TSR |= CAN_TSR_ABRQ2;
		break;
	default:
		break;
	}
}

/*
===============================================================================
                ##### CAN Frames Reception functions #####
 ===============================================================================
    [..] This section provides functions allowing to
      (+) Receive a correct CAN frame
      (+) Release a specified receive FIFO (2 FIFOs are available)
      (+) Return the number of the pending received CAN frames
*/

/****************************************************************************************************
  * @function		-	CAN_Receive
  *
  * @brief			-	This Function Receives a correct CAN frame.
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @param[in]    	-	FIFONumber: Receive FIFO number, CAN_FIFO0 or CAN_FIFO1.
  *
  * @param[in]    	-	RxMessage: pointer to a structure receive frame which contains CAN Id,
  *         			CAN DLC, CAN data and FMI number.
  *
  * @retval			-	None
  *
  * @Note			-	None
  */
void CAN_Receive(CAN_RegDef_t* CANx, uint8_t FIFONumber, CanRxMsg* RxMessage)
{
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));
	assert_param(IS_CAN_FIFO(FIFONumber));

	/* Get the Id */
	RxMessage->IDE = (uint8_t)0x4 & CANx->sFIFOMailBox[FIFONumber].RIR;
	if(RxMessage->IDE == CAN_ID_STD)
	{
		/* Standard CAN */
		RxMessage->StdId = (uint32_t)0x000007FF & (CANx->sFIFOMailBox[FIFONumber].RIR>21);
	}else
	{
		/* Extended CAN */
		RxMessage->StdId = (uint32_t)0x1FFFFFFF & (CANx->sFIFOMailBox[FIFONumber].RIR>3);
	}
	RxMessage->RTR = (uint8_t)0x02 & CANx->sFIFOMailBox[FIFONumber].RIR;

