Quylongtqt/stm32f4xx_drivers/drivers/Src/stm32f407xx_can_driver.c
	/* Get the DLC */
	RxMessage->RTR = (uint8_t)0x0F & CANx->sFIFOMailBox[FIFONumber].RDTR;

	/* Get the FMI */
	RxMessage->FMI = (uint16_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RDTR >> 8);

	/* Get the data field */
	RxMessage->Data[0] = (uint8_t) 0xFF & (CANx->sFIFOMailBox[FIFONumber].RDLR >> 0);
	RxMessage->Data[1] = (uint8_t) 0xFF & (CANx->sFIFOMailBox[FIFONumber].RDLR >> 8);
	RxMessage->Data[2] = (uint8_t) 0xFF & (CANx->sFIFOMailBox[FIFONumber].RDLR >> 16);
	RxMessage->Data[3] = (uint8_t) 0xFF & (CANx->sFIFOMailBox[FIFONumber].RDLR >> 24);
	RxMessage->Data[4] = (uint8_t) 0xFF & (CANx->sFIFOMailBox[FIFONumber].RDHR >> 0);
	RxMessage->Data[5] = (uint8_t) 0xFF & (CANx->sFIFOMailBox[FIFONumber].RDHR >> 8);
	RxMessage->Data[6] = (uint8_t) 0xFF & (CANx->sFIFOMailBox[FIFONumber].RDHR >> 16);
	RxMessage->Data[7] = (uint8_t) 0xFF & (CANx->sFIFOMailBox[FIFONumber].RDHR >> 24);

	/* Release the FIFO */
	if(FIFONumber == CAN_FIFO0)
	{
		/* Release FIFO0 */
		CANx->RF0R |= CAN_RF0R_RFOM0;
	}else
	{
		/* Release FIFO1 */
		CANx->RF1R |= CAN_RF1R_RFOM1;
	}
}

/****************************************************************************************************
  * @function		-	CAN_FIFORelease
  *
  * @brief			-	This Function Releases the specified receive FIFO.
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @param[in]    	-	FIFONumber: Receive FIFO number, CAN_FIFO0 or CAN_FIFO1.
  *
  * @retval			-	None
  *
  * @Note			-	None
  */
void CAN_FIFORelease(CAN_RegDef_t* CANx, uint8_t FIFONumber)
{
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));
	assert_param(IS_CAN_FIFO(FIFONumber));
	/* Release the FIFO */
	if(FIFONumber == CAN_FIFO0)
	{
		/* Release FIFO0 */
		CANx->RF0R |= CAN_RF0R_RFOM0;
	}else
	{
		/* Release FIFO1 */
		CANx->RF1R |= CAN_RF1R_RFOM1;
	}
}

/****************************************************************************************************
  * @function		-	CAN_MessagePending
  *
  * @brief			-	This Function Returns the number of pending received messages.
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @param[in]    	-	FIFONumber: Receive FIFO number, CAN_FIFO0 or CAN_FIFO1.
  *
  * @retval			-	NbMessage : which is the number of pending message.
  *
  * @Note			-	None
  */
uint8_t CAN_MessagePending(CAN_RegDef_t* CANx, uint8_t FIFONumber)
{
	uint8_t message_pending=0;
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));
	assert_param(IS_CAN_FIFO(FIFONumber));

	if(FIFONumber == CAN_FIFO0)
	{
		message_pending = (uint8_t)(CANx->RF0R & (uint32_t)0x03);
	}else if (FIFONumber == CAN_FIFO1)
	{
		message_pending = (uint8_t)(CANx->RF1R & (uint32_t)0x03);
	}else
	{
		message_pending = 0;
	}

	return message_pending;
}

/*
===============================================================================
                    ##### CAN Operation modes functions #####
 ===============================================================================
    [..] This section provides functions allowing to select the CAN Operation modes
      (+) sleep mode
      (+) normal mode
      (+) initialization mode
*/

/****************************************************************************************************
  * @function		-	CAN_OperatingModeRequest
  *
  * @brief			-	This Function Selects the CAN Operation mode.
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @param[in]    	-	CAN_OperatingMode: CAN Operating Mode.
  * 					CAN_OperatingMode_Initialization
  * 					CAN_OperatingMode_Normal
  * 					CAN_OperatingMode_Sleep
  *
  * @retval			-	status of the requested mode which can be:
  * 						CAN_ModeStatus_Failed: CAN failed entering the specific mode
  * 						CAN_ModeStatus_Success: CAN Succeed entering the specific mode
  * @Note			-	None
  */
uint8_t CAN_OperatingModeRequest(CAN_RegDef_t* CANx, uint8_t CAN_OperatingMode)
{
	uint8_t status = CAN_ModeStatus_Failed;
	/* Timeout for INAK or also for SLAK bits*/
	uint32_t timeout = INAK_TIMEOUT;

	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));
	assert_param(IS_CAN_OPERATING_MODE(CAN_OperatingMode));

	if(CAN_OperatingMode == CAN_OperatingMode_Initialization)
	{
		/* Request initialization */
		CANx->MCR = (uint32_t)(((CANx->MCR) & (uint32_t)(~(uint32_t)CAN_MCR_SLEEP)) | CAN_MCR_INRQ);

		/* Wait the acknowledge */
		while( ((CANx->MSR & CAN_MODE_MASK) != CAN_MSR_INAK) && (timeout != 0) )
		{
			timeout--;
		}
		if ((CANx->MSR & CAN_MODE_MASK) != CAN_MSR_INAK)
		{
		  status = CAN_ModeStatus_Failed;
		}
		else
		{
		  status = CAN_ModeStatus_Success;
		}
	}else if(CAN_OperatingMode == CAN_OperatingMode_Normal)
	{
		/* Normal mode */
		/* Request leave initialization and sleep mode  and enter Normal mode */
		CANx->MCR = (uint32_t)(~(CAN_MCR_SLEEP | CAN_MCR_INRQ));
		/* Wait the acknowledge */
		while( (((CANx->MSR) & CAN_MODE_MASK) != 0) && (timeout != 0) )
		{
			timeout--;
		}
		if ((CANx->MSR & CAN_MODE_MASK) != 0)
		{
		  status = CAN_ModeStatus_Failed;
		}
		else
		{
		  status = CAN_ModeStatus_Success;
		}

	}else if(CAN_OperatingMode == CAN_OperatingMode_Sleepde)
	{
		/* Request Sleep mode */
		CANx->MCR = (uint32_t)(((CANx->MCR) & (uint32_t)(~(uint32_t)CAN_MCR_INRQ)) | CAN_MCR_SLEEP);
		/* Wait the acknowledge */
		while( ((CANx->MSR & CAN_MODE_MASK) != CAN_MSR_SLAK) && (timeout != 0) )
		{
			timeout--;
		}
		if ((CANx->MSR & CAN_MODE_MASK) != CAN_MSR_SLAK)
		{
		  status = CAN_ModeStatus_Failed;
		}
		else
		{
		  status = CAN_ModeStatus_Success;
		}
	}else
	{
		status = CAN_ModeStatus_Failed;
	}

	return status;

}

/****************************************************************************************************
  * @function		-	CAN_Sleep
  *
  * @brief			-	This Function Enters the Sleep (low power) mode.
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @retval			-	CAN_Sleep_Ok if sleep entered, CAN_Sleep_Failed otherwise.
  *
  * @Note			-	None
  */

uint8_t CAN_Sleep(CAN_RegDef_t* CANx)
{
	uint8_t sleepstatus = CAN_Sleep_Failed;
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));

	/* Request Sleep mode */
	CANx->MCR = (uint32_t)(((CANx->MCR) & (uint32_t)(~(uint32_t)CAN_MCR_INRQ)) | CAN_MCR_SLEEP);

	/* Sleep mode status */
	if ((CANx->MSR & (CAN_MSR_SLAK | CAN_MSR_INAK)) == CAN_MSR_SLAK)
	{
	  status = CAN_Sleep_Failed;
	}
	else
	{
	  status = CAN_Sleep_Ok;
	}

	/* return sleep mode status */
	return (uint8_t)sleepstatus;
}

/****************************************************************************************************
  * @function		-	CAN_WakeUp
  *
  * @brief			-	This Function Wakes up the CAN peripheral from sleep mode .
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @retval			-	CAN_WakeUp_Ok if sleep mode left, CAN_WakeUp_Failed otherwise.
  *
  * @Note			-	None
  */
uint8_t CAN_WakeUp(CAN_RegDef_t* CANx)
{
	uint8_t wakeupstatus = CAN_Sleep_Failed;
	uint32_t wait_slak = SLAK_TIMEOUT;
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));
	CANx->MCR &= ~(uint32_t)CAN_MCR_SLEEP;
	/* Sleep mode status */
	while(((CANx->MSR & CAN_MSR_SLAK) == CAN_MSR_SLAK)&&(wait_slak != 0))
	{
	wait_slak--;
	}
	if((CANx->MSR & CAN_MSR_SLAK) != CAN_MSR_SLAK)
	{
	/* wake up done : Sleep mode exited */
	wakeupstatus = CAN_WakeUp_Ok;
	}
	/* return wakeup status */
	return (uint8_t)wakeupstatus;
}

