Quylongtqt/stm32f4xx_drivers/drivers/Src/stm32f407xx_can_driver.c
/*
===============================================================================
                ##### CAN Bus Error management functions #####
 ===============================================================================
    [..] This section provides functions allowing to
      (+) Return the CANx's last error code (LEC)
      (+) Return the CANx Receive Error Counter (REC)
      (+) Return the LSB of the 9-bit CANx Transmit Error Counter(TEC).

      -@- If TEC is greater than 255, The CAN is in bus-off state.
      -@- if REC or TEC are greater than 96, an Error warning flag occurs.
      -@- if REC or TEC are greater than 127, an Error Passive Flag occurs.
*/

/****************************************************************************************************
  * @function		-	CAN_GetLastErrorCode
  *
  * @brief			-	This Function Returns the CANx's last error code (LEC).
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @retval			-	Error code:
  *         			 - CAN_ERRORCODE_NoErr: No Error
  *         			 - CAN_ERRORCODE_StuffErr: Stuff Error
  *         			 - CAN_ERRORCODE_FormErr: Form Error
  *         			 - CAN_ERRORCODE_ACKErr : Acknowledgment Error
  *        				 - CAN_ERRORCODE_BitRecessiveErr: Bit Recessive Error
  *         			 - CAN_ERRORCODE_BitDominantErr: Bit Dominant Error
  *        				 - CAN_ERRORCODE_CRCErr: CRC Error
  *         			 - CAN_ERRORCODE_SoftwareSetErr: Software Set Error
  *
  * @Note			-	None
  */
uint8_t CAN_GetLastErrorCode(CAN_RegDef_t* CANx)
{
	uint8_t errorcode = 0;
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));

	/* Get error code */
	errorcode = ((uint8_t)(CANx->ESR) & (uint8_t)CAN_ESR_LEC);

	/* Return the error code*/
	return errorcode;
}

/****************************************************************************************************
  * @function		-	CAN_GetReceiveErrorCounter
  *
  * @brief			-	This Function Returns the CANx Receive Error Counter (REC).
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @retval			-	CAN Receive Error Counter.
  *
  * @Note			-	In case of an error during reception, this counter is incremented
  *        				by 1 or by 8 depending on the error condition as defined by the CAN
  *         			standard. After every successful reception, the counter is
  *         			decremented by 1 or reset to 120 if its value was higher than 128.
  *         			When the counter value exceeds 127, the CAN controller enters the
  *         			error passive state.
  */
uint8_t CAN_GetReceiveErrorCounter(CAN_RegDef_t* CANx)
{
	unit8_t counter = 0;
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));

	/* Get receive Error Counter */
	counter = (uint8_t)((CANx->ESR & CAN_ESR_REC) >> 24);

	/* Return the Receive Error Counter */
	return counter;
}

/****************************************************************************************************
  * @function		-	CAN_GetLSBTransmitErrorCounter
  *
  * @brief			-	This Function Returns the LSB of the 9-bit CANx Transmit Error Counter(TEC).
  *
  * @param[in]    	-	CANx: where x can be 1 or 2 to to select the CAN peripheral.
  *
  * @retval			-	LSB of the 9-bit CAN Transmit Error Counter.
  *
  * @Note			-	None
  */
uint8_t CAN_GetLSBTransmitErrorCounter(CAN_RegDef_t* CANx)
{
	unit8_t counter = 0;
	/* Check the parameters */
	assert_param(IS_CAN_ALL_PERIPH(CANx));

	/* Get LSB of the 9-bit CANx Transmit Error Counter(TEC) */
	counter = (uint8_t)((CANx->ESR & CAN_ESR_TEC) >> 16);

	/* Return the LSB of the 9-bit CANx Transmit Error Counter(TEC) */
	return counter;
}

/*
===============================================================================
              ##### Interrupts and flags management functions #####
 ===============================================================================

     [..] This section provides functions allowing to configure the CAN Interrupts
          and to get the status and clear flags and Interrupts pending bits.

          The CAN provides 14 Interrupts sources and 15 Flags:


  *** Flags ***
  =============
    [..] The 15 flags can be divided on 4 groups:

      (+) Transmit Flags
        (++) CAN_FLAG_RQCP0,
        (++) CAN_FLAG_RQCP1,
        (++) CAN_FLAG_RQCP2  : Request completed MailBoxes 0, 1 and 2  Flags
                               Set when when the last request (transmit or abort)
                               has been performed.

      (+) Receive Flags


        (++) CAN_FLAG_FMP0,
        (++) CAN_FLAG_FMP1   : FIFO 0 and 1 Message Pending Flags
                               set to signal that messages are pending in the receive
                               FIFO.
                               These Flags are cleared only by hardware.

        (++) CAN_FLAG_FF0,
        (++) CAN_FLAG_FF1    : FIFO 0 and 1 Full Flags
                               set when three messages are stored in the selected
                               FIFO.

        (++) CAN_FLAG_FOV0
        (++) CAN_FLAG_FOV1   : FIFO 0 and 1 Overrun Flags
                               set when a new message has been received and passed
                               the filter while the FIFO was full.

      (+) Operating Mode Flags

        (++) CAN_FLAG_WKU    : Wake up Flag
                               set to signal that a SOF bit has been detected while
                               the CAN hardware was in Sleep mode.

        (++) CAN_FLAG_SLAK   : Sleep acknowledge Flag
                               Set to signal that the CAN has entered Sleep Mode.

      (+) Error Flags

        (++) CAN_FLAG_EWG    : Error Warning Flag
                               Set when the warning limit has been reached (Receive
                               Error Counter or Transmit Error Counter greater than 96).
                               This Flag is cleared only by hardware.

        (++) CAN_FLAG_EPV    : Error Passive Flag
                               Set when the Error Passive limit has been reached
                               (Receive Error Counter or Transmit Error Counter
                               greater than 127).
                               This Flag is cleared only by hardware.

        (++) CAN_FLAG_BOF    : Bus-Off Flag
                               set when CAN enters the bus-off state. The bus-off
                               state is entered on TEC overflow, greater than 255.
                               This Flag is cleared only by hardware.

        (++) CAN_FLAG_LEC    : Last error code Flag
                               set If a message has been transferred (reception or
                               transmission) with error, and the error code is hold.

  *** Interrupts ***
  ==================
    [..] The 14 interrupts can be divided on 4 groups:

      (+) Transmit interrupt

        (++) CAN_IT_TME   :  Transmit mailbox empty Interrupt
                             if enabled, this interrupt source is pending when
                             no transmit request are pending for Tx mailboxes.

      (+) Receive Interrupts

        (++) CAN_IT_FMP0,
        (++) CAN_IT_FMP1    :  FIFO 0 and FIFO1 message pending Interrupts
                               if enabled, these interrupt sources are pending
                               when messages are pending in the receive FIFO.
                               The corresponding interrupt pending bits are cleared
                               only by hardware.

        (++) CAN_IT_FF0,
        (++) CAN_IT_FF1     :  FIFO 0 and FIFO1 full Interrupts
                               if enabled, these interrupt sources are pending
                               when three messages are stored in the selected FIFO.

        (++) CAN_IT_FOV0,
        (++) CAN_IT_FOV1    :  FIFO 0 and FIFO1 overrun Interrupts
                               if enabled, these interrupt sources are pending
                               when a new message has been received and passed
                               the filter while the FIFO was full.

      (+) Operating Mode Interrupts

